---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryConnectorData.Profile
source: html/0c10d8b2-dc23-35d1-89ea-42824587de86.htm
---
# Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryConnectorData.Profile Property

The connector profile.

## Syntax (C#)
```csharp
public ConnectorProfileType Profile { get; }
```